In [17]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from config import password

In [18]:
csv = pd.read_csv('median_income_data.csv')
csv

,"Table with row headers in column A and column headers in rows 5 and 6, and 60 and 61",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 65,Unnamed: 66,Unnamed: 67,Unnamed: 68,Unnamed: 69,Unnamed: 70,Unnamed: 71,Unnamed: 72,Unnamed: 73,Unnamed: 74
0,Table H-8. Median Household Income by State: ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,(Households as of March of the following year....,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,CURRENT DOLLARS,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,State,2018,NaN,2017 (40),NaN,2017,NaN,2016,NaN,2015,...,1988,NaN,1987 (21),NaN,1986,NaN,1985 (20),NaN,1984 (19),NaN
4,NaN,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,...,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
110,Wisconsin,"62,629","2,039","65,029","2,979","64,998","3,763","62,593","1,931","58,745",...,"60,525","2,001","55,913","2,990","57,970","1,761","51,879","2,591","47,882","1,895"
111,Wyoming,"62,539","3,892","60,987","3,262","59,247","3,210","60,513","3,267","64,575",...,"54,066","2,241","58,502","3,092","51,673","1,893","49,279","2,341","54,976","1,687"
112,"Source: U.S. Bureau of the Census, Current Pop...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
113,Footnotes are available at <www.census.gov/top...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
114,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [19]:
# This is how I knew which rows were specifically for Florida

# florida = csv.loc[csv['Table with row headers in column A and column headers in rows 5 and 6, and 60 and 61'] == 'Florida']
# florida

In [20]:
# csv_florida = csv.iloc[[3, 4, 15, 70], :]
# csv_florida

In [22]:
all_na = csv.dropna(axis='rows')
all_na

,"Table with row headers in column A and column headers in rows 5 and 6, and 60 and 61",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 65,Unnamed: 66,Unnamed: 67,Unnamed: 68,Unnamed: 69,Unnamed: 70,Unnamed: 71,Unnamed: 72,Unnamed: 73,Unnamed: 74
5,United States,"63,179",420,"61,136",322,"61,372",335,"59,039",436,"56,516",...,"27,225",139,"26,061",127,"24,897",129,"23,618",128,"22,415",102
6,Alabama,"49,936","2,423","50,865","1,094","51,113",845,"47,221","2,301","44,509",...,"19,948",912,"19,734","1,147","19,132",885,"18,333",760,"17,310",605
7,Alaska,"68,734","3,390","77,987","3,718","72,231","2,719","75,723","4,086","75,112",...,"33,103","1,183","33,233","1,497","31,356","1,017","34,782","1,089","32,356","1,473"
8,Arizona,"62,283","2,291","59,700","2,689","61,125","2,642","57,100","1,971","52,248",...,"26,435",843,"26,749",892,"25,500",718,"23,877",744,"21,425",609
9,Arkansas,"49,781","2,108","49,751","2,491","48,829","2,642","45,907","2,165","42,798",...,"20,172",706,"18,827","1,008","18,730",765,"17,451",764,"15,674",748
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
107,Virginia,"77,151","3,086","72,537","3,898","73,031","3,356","69,535","2,549","65,169",...,"66,814","2,699","63,604","2,148","65,176","2,356","63,446","2,955","61,229","2,018"
108,Washington,"79,726","3,025","73,284","2,176","77,256","3,388","73,573","2,189","71,271",...,"66,157","2,108","57,928","2,349","58,960","2,084","53,562","1,687","57,748","1,900"
109,West Virginia,"50,573","1,337","48,102","1,308","46,499","1,521","46,412","2,087","45,389",...,"39,606","1,903","36,486","1,650","36,111","1,985","35,670","1,848","38,880","1,403"
110,Wisconsin,"62,629","2,039","65,029","2,979","64,998","3,763","62,593","1,931","58,745",...,"60,525","2,001","55,913","2,990","57,970","1,761","51,879","2,591","47,882","1,895"
111,Wyoming,"62,539","3,892","60,987","3,262","59,247","3,210","60,513","3,267","64,575",...,"54,066","2,241","58,502","3,092","51,673","1,893","49,279","2,341","54,976","1,687"

In [11]:
# fl_homeless_new = csv_florida.transpose()
# fl_homeless_new

homeless_new = all_na.T.reset_index(); 
income_table = homeless_new[homeless_new.columns[::-1]]
income_table.head()

,111,110,109,108,107,106,105,104,103,102,...,13,12,11,10,9,8,7,6,5,index
0,Wyoming,Wisconsin,West Virginia,Washington,Virginia,Vermont,Utah,Texas,Tennessee,South Dakota,...,Delaware,Connecticut,Colorado,California,Arkansas,Arizona,Alaska,Alabama,United States,Table with row headers in column A and column ...
1,"62,539","62,629","50,573","79,726","77,151","70,066","77,067","59,785","56,060","59,463",...,"65,012","72,812","73,034","70,489","49,781","62,283","68,734","49,936","63,179",Unnamed: 1
2,"3,892","2,039","1,337","3,025","3,086","2,350","2,327","1,372","1,442","2,642",...,"3,599","5,119","3,562","1,233","2,108","2,291","3,390","2,423",420,Unnamed: 2
3,"60,987","65,029","48,102","73,284","72,537","65,234","71,490","61,557","56,654","58,301",...,"64,961","74,304","74,984","70,038","49,751","59,700","77,987","50,865","61,136",Unnamed: 3
4,"3,262","2,979","1,308","2,176","3,898","3,389","2,217","1,358","2,183","4,083",...,"5,230","3,453","2,661","1,576","2,491","2,689","3,718","1,094",322,Unnamed: 4

In [14]:
arbitrary = income_table.drop(columns =['index'])
arbitrary.head()

,111,110,109,108,107,106,105,104,103,102,...,14,13,12,11,10,9,8,7,6,5
0,Wyoming,Wisconsin,West Virginia,Washington,Virginia,Vermont,Utah,Texas,Tennessee,South Dakota,...,D.C.,Delaware,Connecticut,Colorado,California,Arkansas,Arizona,Alaska,Alabama,United States
1,"62,539","62,629","50,573","79,726","77,151","70,066","77,067","59,785","56,060","59,463",...,"85,750","65,012","72,812","73,034","70,489","49,781","62,283","68,734","49,936","63,179"
2,"3,892","2,039","1,337","3,025","3,086","2,350","2,327","1,372","1,442","2,642",...,"2,659","3,599","5,119","3,562","1,233","2,108","2,291","3,390","2,423",420
3,"60,987","65,029","48,102","73,284","72,537","65,234","71,490","61,557","56,654","58,301",...,"81,282","64,961","74,304","74,984","70,038","49,751","59,700","77,987","50,865","61,136"
4,"3,262","2,979","1,308","2,176","3,898","3,389","2,217","1,358","2,183","4,083",...,"1,903","5,230","3,453","2,661","1,576","2,491","2,689","3,718","1,094",322

In [15]:
arbitrary.to_csv('income_csv_cleaning', index=False)

In [16]:
dirty_csv = pd.read_csv('income_csv_cleaning')
dirty_csv.head()

,111,110,109,108,107,106,105,104,103,102,...,14,13,12,11,10,9,8,7,6,5
0,Wyoming,Wisconsin,West Virginia,Washington,Virginia,Vermont,Utah,Texas,Tennessee,South Dakota,...,D.C.,Delaware,Connecticut,Colorado,California,Arkansas,Arizona,Alaska,Alabama,United States
1,"62,539","62,629","50,573","79,726","77,151","70,066","77,067","59,785","56,060","59,463",...,"85,750","65,012","72,812","73,034","70,489","49,781","62,283","68,734","49,936","63,179"
2,"3,892","2,039","1,337","3,025","3,086","2,350","2,327","1,372","1,442","2,642",...,"2,659","3,599","5,119","3,562","1,233","2,108","2,291","3,390","2,423",420
3,"60,987","65,029","48,102","73,284","72,537","65,234","71,490","61,557","56,654","58,301",...,"81,282","64,961","74,304","74,984","70,038","49,751","59,700","77,987","50,865","61,136"
4,"3,262","2,979","1,308","2,176","3,898","3,389","2,217","1,358","2,183","4,083",...,"1,903","5,230","3,453","2,661","1,576","2,491","2,689","3,718","1,094",322

In [75]:
dirty_csv.rename(columns = {'70': 'Florida', '15': 'Florida_Too', '4': 'Median_Income', '3': 'Year'}, inplace = True)
dirty_csv
dirty_csv.to_csv('final_median_income_csv', index=False)

In [76]:
clean_csv = pd.read_csv('final_median_income_csv')
clean_csv.head()

  Florida Florida_Too   Median_Income       Year
0  54,644      54,644  Median\nincome       2018
1  54,380      53,086  Median\nincome  2017 (40)
2  54,990      53,681  Median\nincome       2017
3  53,551      51,176  Median\nincome       2016
4  51,750      48,825  Median\nincome       2015

In [103]:
# Hey guess what!?
# pgAdmin doesn't like commas...

narrowed_df = clean_csv.drop(['Median_Income'], axis=1)
narrowed_df.rename(columns = {'Florida': 'national_average', 'Florida_Too': 'median_income', 'Year': 'year'}, inplace = True)
narrowed_df.head()

  national_average median_income       year
0           54,644        54,644       2018
1           54,380        53,086  2017 (40)
2           54,990        53,681       2017
3           53,551        51,176       2016
4           51,750        48,825       2015

In [106]:
# Getting rid of them over here
national_average = narrowed_df['national_average'].str.replace("," , "")

In [108]:
# Getting rid of commas right hereeeee...
median_income = narrowed_df['median_income'].str.replace("," , "")

In [126]:
# Turns out pgAdmin doesn't like "( )" either
# So we're removing those here...
year = narrowed_df['year'].str.replace(r"\s*\([^()]*\)","").str.strip()

In [131]:
# Going to have to add them back into the dataframe after they're all cleaned up
median_incomes_florida = pd.DataFrame ({
    'national_average': national_average,
    'median_income': median_income,
    'year': year
})

twelve_yrs = median_incomes_florida.head(12)
twelve_yrs

   national_average median_income  year
0             54644         54644  2018
1             54380         53086  2017
2             54990         53681  2017
3             53551         51176  2016
4             51750         48825  2015
5             48988         46140  2014
6             52400         48532  2013
7             51703         47886  2013
8             50480         46071  2012
9             50468         45105  2011
10            50860         44066  2010
11            53535         45631  2009

In [120]:
postgres_conn_string = f"postgres:{password}" 
engine = create_engine(f"postgresql://{postgres_conn_string}@localhost:5432/housing", paramstyle="format")

In [132]:
twelve_yrs.to_sql(name='incomes', con=engine, if_exists='append', index=False)

In [133]:
pd.read_sql_query('SELECT * FROM incomes', con=engine).head()

   national_average  median_income  year
0             54644          54644  2018
1             54380          53086  2017
2             54990          53681  2017
3             53551          51176  2016
4             51750          48825  2015